app/controllers/api/v1/todolist_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Ben' LIMIT 1
---
    def index
        @user = nil
        if request.query_parameters.present?
            @user_id = params[:user_id]
            if (@user_id)
                @user = User.find(@user_id)
            end

            @user_name = params[:user_name]
            if (@user_name)
                @user = User.find_by username: @user_name

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'ben' LIMIT 1
---
    def show
        @user = nil
        if request.query_parameters.present?
            @user_id = params[:user_id]
            if (@user_id)
                @user = User.find(@user_id)
            end

            @user_name = params[:user_name]
            if (@user_name)
                @user = User.find_by username: @user_name

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Ben' LIMIT 1
INSERT INTO `items` (`user_id`, `description`, `priority`, `created_at`, `updated_at`) VALUES (1, 'test', 0, '2022-03-27 15:56:32', '2022-03-27 15:56:32')
---
    def create
        @user = nil
        if request.query_parameters.present?
            @user_id = params[:user_id]
            if (@user_id)
                @user = User.find(@user_id)
            end

            @user_name = params[:user_name]
            if (@user_name)
                @user = User.find_by username: @user_name
            end
        end

        if (@user)
            @item = Item.new(item_params)
            if (@item.save)

UPDATE `items` SET `description` = 'test 2', `priority` = 2, `updated_at` = '2022-03-27 16:15:08' WHERE `items`.`id` = 2
---
    def update
        if (@item)
            @item.update(item_params)

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
---
    def find_item
        @item = Item.find(params[:id])