app/todo-list-manager/handlers/CreateTodoItemHandler.rb

INSERT INTO `items` (`user_id`, `description`, `priority`, `created_at`, `updated_at`) VALUES (1, 'this item has been created with chain of responsibility', 0, '2022-04-01 14:59:38', '2022-04-01 14:59:38')
---
    def handle (chainable_request)
        @user = chainable_request.data.user
        if (@user)
            @description = chainable_request.input.newItem["description"]
            @priority = chainable_request.input.newItem["priority"]

            @user.tap do |user|

                createdItem = Item.create(description: @description, priority: @priority, user: user)