app/todo-list-manager/handlers/QueryItemByIdHandler.rb

    def handle (chainable_request)
        puts "enter query item handler"
        itemId = chainable_request.input.itemId
        if (itemId)
            item = Item.find(itemId)
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1