app/todo-list-manager/handlers/UserIdHandler.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    def handle (chainable_request)
        @request = chainable_request.input
        if @request
            @user_id = @request.userId
            if (@user_id)
                @user = User.find_by_id(@user_id)