app/todo-list-manager/handlers/UserNameHandler.rb

    def handle (chainable_request)
        if !(chainable_request.data.user)
            @request = chainable_request.input
            if @request
                @user_name = @request.userName
                if (@user_name)
                    @user = User.find_by username: @user_name
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Ben' LIMIT 1